function execute() {
    let fileDate = '22-04-18';
    if (sessionStorage.getItem('execute_all') == 'true' || sessionStorage.getItem('execute_all') == 'direct') {
        loading(fileDate, call(fileDate));
    } else {
        if (location.search.length == 0) {
            loading(fileDate, call(fileDate));
        } else {
            console.log(location.search);
        }
    }
}

if (sessionStorage.getItem('fileDate' + "220418") == "220418") {} else {
    execute();
    sessionStorage.setItem('fileDate' + "220418", "220418");
    window.addEventListener('load', function () {
        sessionStorage.removeItem('fileDate' + "220418");
    });
}

function call(fileDate) {
    tit('填空 * 30', fileDate, 1);

    Q_KV_module([
        [
            'DNS可将域名翻译成___地址。',
            'IP',
            1
        ],
        [
            '广域网的简称为___。',
            'WAN',
            2
        ],
        [
            '___是我国第一个商业网。',
            '<p style="letter-spacing: 0.36rem;">Chinanet</p>',
            4
        ],
        [
            '中国互联网的域名体系顶级域名为___。',
            'cn',
            2
        ],
        [
            'Internet顶级域名分为___名和___名两类。',
            '区域 类型',
            4
        ],
        [
            '搜索引擎的原理起源于传统的信息全文___理论。',
            '检索',
            3
        ],
        [
            '域名的结构为：___名.机构名.___名.最高层域名',
            '主机 网络',
            7
        ],
        [
            'FrontPage是属于___家族的一员',
            'MicrosoftOffice',
            4
        ],
        [
            '超文本是以___方式组织的',
            b('非线性'),
            5
        ],
        [
            '地球同步卫星绕地球一周的时间大约是___小时。',
            '24',
            6
        ],
        [
            'IP' + i('（V4）') + '地址为一组长度___位的二进制数组成。',
            '32' + '<br><span style="margin-left: 6rem"></span>' + i(b(u('IPV4：32位<br><span style="margin-left: 6rem"></span>IPV6：128位'))),
            6
        ],
        [
            '传输距离最长、可靠性最高的传输介质是___',
            '光纤',
            1
        ],
        [
            '电子乐器接到___接口后，可记录电子乐器生成的音乐，\n\t以后可编辑它们，或与其它乐器的声音进行组合，产生类似管弦乐队音乐。',
            b('MIDI'),
            7
        ],
        [
            '总的来说，___就是负责录音、播音和声音合成计算机硬件插卡。',
            '声卡',
            1
        ],
        [
            '___操作系统与___操作系统的主要区别在于资源管理、进程通信和系统结构上。',
            b('分布式 集中式'),
            7
        ],
        [
            '在IE浏览器窗口中，要重新载入当前页，可单击工具栏___按钮。',
            '刷新',
            1
        ],
        [
            '多媒体计算机系统由多媒体___系统和多媒体___系统。' + i('（又来病句了是吧？）'),
            '硬件 软件',
            2
        ],
        [
            '虚拟主机，也叫“网站空间”，就是把一台运行在互联网上的物理服务器划分成多个“虚拟”___。',
            '服务器',
            2
        ],
        [
            '显卡测试指标有显示芯片、___类型、显存大小、___、刷新率、色深、其他技术指标性能等.',
            '接口 分辨率',
            2
        ],
        [
            `所谓的___就是一步步地插入或拔掉不同部件，
            \t每次插拔后开机观察故障现象的变化来判断故障点的方法，
            \t值得注意的是在替换部件时，各部件型号必须一致或互相兼容，
            \t注意的是多个部件插拔时要留意部件插拔顺序。`,
            b('插拔法'),
            2
        ],
        [
            `所谓的清洁法就是使用毛刷、吸尘器等工具清洁故障部件，
            \t避免灰尘、污物造成___或___的方法，这是个简单而十分有效的方法。`,
            '短路 断路',
            1
        ],
        [
            '万用表一般用途测交流电与直流电的___和___，测电阻，测二极管，测三极管。',
            '电压 电流',
            1
        ],
        [
            `三极管，全称应为半导体三极管，也称晶体三极管，
            \t三极管是在一块半导体基片上制作两个相距很近的___结，
            \t两个PN结把整块半导体分成三部分，排列方式有PNP和NPN两种。
            ` + i('\n<p style="font-size: 0.64rem;">\t这个起放大电流的作用，我以前曾用这个“复活”过一块电池，本质就是靠硅的半导体属性</p>\n'),
            'PN',
            2
        ],
        [
            `电感器将电能转化为磁能存储起来的器件，
            \t电感器又称扼流器、电抗器、动态电抗器，用___表示。`,
            'L',
            3
        ],
        [
            '晶体二极管是一种半导体器件，具有非线性的伏安特性，用___表示，主要作用是单向导电。',
            'D',
            3
        ],
        [
            '电容在电路中用来储存电荷和电能，用___表示。',
            'C',
            3
        ],
        [
            '电阻可以说是电路工程中最常用的电子元器件，用___表示，在电路中的作用主要是___等。',
            'R' + b('\t分流分压限流'),
            2
        ],
        [
            '目前市场上的 BIOS 芯片主要用AMI BIOS、___ BIOS和 ___ BIOS.',
            'Award,award <span style="margin-left: 0.6rem;"></span>Phoenix,phoenix',
            7
        ],
        [
            '主板的品牌型号不同，启动BIOS的___也有所不同，具体以屏幕左下角的___为准。',
            '热键 提示',
            1
        ],
        [
            '在计算机网络中,其网络传输速率的单位用b/s___或bps表示，带宽100Mbps理论上最大下载速度为：___MB/S' +
            i('<p style="font-size: 0.64rem;">\n\t1MB/S = 8Mb/S\t应该算常识吧</p>\n'),
            '比特每秒 12.5',
            1
        ]
    ], [
        ['addClass', 'mainCtr_' + fileDate]
    ])
}