function execute() {
    let fileDate = '22-04-11';
    if (sessionStorage.getItem('execute_all') == 'true' || sessionStorage.getItem('execute_all') == 'direct') {
        loading(fileDate, call(fileDate));
    } else {
        if (location.search.length == 0) {
            loading(fileDate, call(fileDate));
        } else {
            console.log(location.search);
        }
    }
}

if (sessionStorage.getItem('fileDate' + "220411") == "220411") {} else {
    execute();
    sessionStorage.setItem('fileDate' + "220411", "220411");
    window.addEventListener('load', function () {
        sessionStorage.removeItem('fileDate' + "220411");
    });
}

function call(fileDate) {
    tit('多选题 * 36', fileDate, 1);

    Q_KV_module([
        ['使用FTP服务下载资料时,下列说法正确的是( ).',
            ['需要登录到该资源所在的' + b('FTP服务器'), '', '', '需要知道该资源所在' + b('FTP服务器的地址')],
            2, 'list'
        ],
        ['配置多站点的方法主要包括( )',
            ['使用不同' + b('主机名'), '使用不同' + b('端口号'), '使用不同' + b('ip地址')],
            4, 'list'
        ],
        ['下列IP地址中( )是A类地址。',
            ['121.233.13.34', '15.87.20.51'],
            7, 'list'
        ],
        ['下列各项中属于正确的IP地址的是( )',
            ['', '192.168.1.5', '172.16.1.5'],
            2, 'list'
        ],
        ['在小明同学家里，小明和爸爸两人分别通过路由器共享上网，由路由器自动分配IP地址，\n\t已知小明电脑的IP地址是192.168.3.4，那么他爸爸电脑的IP地址可能是( )。',
            ['', '192.168.3.8', '', '192.168.3.12'],
            3, 'list'
        ],
        ['某机房内有500台计算机实现计算机之间的互联，\n\t则其中某两台计算机的IP地址可以设置为( )。',
            ['10.59.207.5和10.59.207.10', '', '', '172.16.5.1和172.16.6.1'],
            2, 'list'
        ],
        ['以下属于网络传输介质的是( ).',
            ['光纤', '双绞线'],
            1, 'list'
        ],
        ['国家政府机构颁布的涉及计算机犯罪相关的法律法规有：( )。',
            [
                '《中华人民共和国刑法》',
                '《计算机信息网络国际联网安全保护管理办法》',
                '《计算机信息系统安全专用产品检测和销售许可证管理办法》',
                '《软件产品管理办法》'
            ],
            4, 'list'
        ],
        ['常见的计算机犯罪类型有：( )等',
            ['知识产权的侵权', '网络诈骗', '网络暴力', '网上诽谤', '非法入侵和破坏计算机系统'],
            2, 'list'
        ],
        ['法律可以划分为：( )法律。',
            ['宪法', '行政法规', '自治条例和单行条例', '地方性法规'],
            5, 'list'
        ],
        ['职业意识是人们对职业劳动的认识、评价、情感和态度等心理成分的综合反映，\n\t是支配和调控全部职业行为和职业活动的调节器，它包括( )等方面。',
            ['创新意识', '竞争意识', '协作意识', '奉献意识'],
            2, 'list'
        ],
        ['使用刻录软件制作数据光盘，需要( )',
            ['带有刻录机的电脑', '', '刻录软件', '刻录光盘'],
            2, 'list'
        ],
        ['安装刻录软件的操作过程有( )。',
            ['将刻录软件下载到电脑里', '双击下载好的软件', '选择安装路径', '等待程序安装过程结束并点击“完成”按钮'],
            1, 'list'
        ],
        ['以下哪些是EasyRecovery的优点( )。',
            [
                '易于使用和完全自动化的向导，引导用户使用程序',
                '运行在上述任何操作系统环境下，程序可以访问任何Windows或Mac OS X文件系统',
                '使用系统API进行标准写操作，最大限度地减少磁盘损坏的机会',
                '自由访问网络和其它安装的外围设备，如：USB，闪存，外部硬盘驱动器'
            ],
            2, 'list'
        ],
        ['广义上的桌面美化，包括( )和桌面增强软件等所有可以改变视觉外观的方面。',
            ['字体', '屏幕保护', '软件皮肤'],
            2, 'list'
        ],
        ['下列软件中能够设置桌面壁纸的软件有( )。',
            ['ObjectDock', '', '小智桌面'],
            2, 'list'
        ],
        ['Adobe ActiveSbare提供了( )以及预方式查看照片，同时还能方便地将照片创建为墙。',
            ['略图', '幻灯片'],
            2, 'list'
        ],
        ['ACDSee32支持下方哪些格式( )。',
            ['JPEG', 'PCX', 'Kodak Photo', 'TGA'],
            2, 'list'
        ],
        ['楠楠想在联欢会上演唱“隐形的翅膀”这首歌曲，通过网上搜索，找到了自己想要的音乐伴奏文件，\n\t下列肯定能下载该文件的操作方法( )。',
            ['使用网际快车下载工具下载 ' + i(' （"十年网龄の泪"）'), '右击该歌曲的下载链接，选择“目标另存为……”', '使用迅雷下载工具下载'],
            1, 'list'
        ],
        ['Ashampoo Photo Commander图片管理软件的特点( )',
            ['照片管理软件', '音频管理软件', 'MP4管理软件'],
            3, 'list'
        ],
        ['小明要录制一段诗朗诵到计算机上，下列说法正确的是( )。',
            ['', '可以使用 Audition 软件进行录制', '录制好的文件可以转换为 Mp3 格式', '录制的音频时数字音频' + i(' （时？是？制题人可是日本裁判？）')],
            6, 'list'
        ],
        ['以下哪一项是音视频编码格式( )。',
            [b('Window Media Video Codec 9'), '', 'HE-AAC', 'MPEG-2'],
            3, 'list'
        ],
        ['多媒体文件的特点是( )。',
            ['', '交互性', '集成性', '智能性'],
            5, 'list'
        ],
        ['多媒体包含以下( )一类的文件。',
            ['视频', '音频', '图片'],
            1, 'list'
        ],
        ['WinRAR可以解压的文件格式是( )。',
            ['RAR', 'ZIP', b('CAB')],
            2, 'list'
        ],
        ['WinRAR是现在较流行的压缩工具之一，其功能有( )。',
            ['快速压缩文档', '设置压缩密码', '制作分卷压缩包'],
            1, 'list'
        ],
        ['下列软件属于下载工具软件的是( ).',
            ['迅雷', 'BT', '电驴'],
            1, 'list'
        ],
        ['提前的备份工作可以确保发生( )风险时的工作保障。',
            ['系统损坏', '数据丢失', b('操作记录查询')],
            2, 'list'
        ],
        ['系统自带的备份的优点是( )。',
            ['操作简单', b('无压缩'), '速度快'],
            2, 'list'
        ],
        ['系统还原的几种方式( )。',
            ['系统自带的"系统还原"', b('一键GHOST', b('还原卡'))],
            2, 'list'
        ],
        ['下列那些是驱动软件程序( )。',
            ['', '驱动精灵', '驱动大师'],
            1, 'list'
        ],
        ['简述设备驱动程序通常要完成以下哪些工作( )。',
            ['传送必要的参数', '启动设备', '', '检查请求的合法性'],
            7, 'list'
        ],
        ['重新安装系统时应该将哪些磁盘进行格式化。( )',
            ['', '', '系统磁盘', 'C盘 ' + b(i(' （可以通过一些操作使系统盘改为其他盘符，这里不严谨）'))],
            2, 'list'
        ],
        ['对电脑系统的优化包括以下哪些( )。',
            ['系统缓存优化', '', '电脑开机速度', '加快文件的打开'],
            2, 'list'
        ],
        ['系统清理优化功能包括( )。',
            ['清理缓' + b('冲'), '清理注册表', '整理启动项'],
            1, 'list'
        ],
        ['系统优化的作用( )。',
            ['减少执行少的进程' + i('（改为“非常用进程”之类的不更好）'), '更改工作模式', '优化文件位置'],
            2, 'list'
        ],
    ], [
        ['addClass', 'mainCtr_' + fileDate]
    ])
}