function execute() {
    let fileDate = '22-03-16';
    if (sessionStorage.getItem('execute_all') == 'true' || sessionStorage.getItem('execute_all') == 'direct') {
        loading(fileDate, call(fileDate));
    } else {
        if (location.search.length == 0) {
            loading(fileDate, call(fileDate));
        } else {
            console.log(location.search);
        }
    }
}

if (sessionStorage.getItem('fileDate' + "220316") == "220316") {} else {
    execute();
    sessionStorage.setItem('fileDate' + "220316", "220316");
    window.addEventListener('load', function () {
        sessionStorage.removeItem('fileDate' + "220316");
    });
}

function call(fileDate) {
    tit('单选 * 70', fileDate, 1);

    Q_KV_module([
        ['按数据的传输方式可以将网卡分为( )。', '半双工和全双工', 3],
        ['USB 网卡有 10M 和 10/100M 自适应两种，它的一端是( ) 接口，另一端是 USB 接口。', 'RJ45', 4],
        ['从理论上说，目前，Modem、ISDN 和ADSL 的最大上传速度分别可达到 ( ) 。', '56K 、 128K 、 1M', 5],
        ['Modem 的传输速率，指的是 ( ) 传送的数据量大小。', '每秒钟', 2],
        ['目前Internet传输控制的最常用通用协议为( )。', 'TCP/IP协议', 4],
        ['ADSL采用( )享型 网络结构。', '共', 3],
        ['操作系统防御黑客攻击，下列方案中哪一个是最有效的？( )', '操作系统全面更新补丁', 1],
        ['键盘、显示器等常用外设在系统启动时都需要参与工作，它们的驱动程序必须存放在( )。', 'BIOS', 2],
        ['在Windows XP中，若某硬件驱动程序设置不当，则从控制面板中进入“系统”，再打开“设备管理”，在“系统设备”中将会看到在设备名称前会出现黄色( )图标。', '!', 1],
        ['在Windows 2000中,如果发现显示方式只是“640×480”分辨率通常原因是( )。', '没安装相应的显示驱动程序', 1],
        ['在硬盘重写硬盘主引导区的DOS命令是( )。', 'fdisk /mbr', 5],
        ['下列不是硬盘分区的格式是( )。', 'XP格式', 1],
        ['一台计算机硬盘分为三个区，分别为C：、D：和E：，使用一段时间后当进入E盘时出错，屏幕显示“Invalid drive specificatioa”信息，故障原因是( )。', '硬盘分区表损坏', 5],
        ['硬盘格式化时用的DOS命令是( )。', 'fdisk', 5],
        ['( )是控制和管理计算机硬件和软件资源、合理地组织计算机工作流程、方便用户使用的程序集合。', '操作系统', 2],
        ['外部存储器区别于内部存储器的最大特点是( )。', '容量大', 3],
        ['下列有关灰尘对电脑的影响说法不正确的是( )。', '鼠标、键盘对灰尘的灵敏度不高，在防尘方面没有过高要求', 2],
        ['交换机和集线器都遵循的标准是( )。', 'IEEE802.3', 5],
        ['USB 网卡有 10M 和 10/100M 自适应两种，它的一端是( ) 接口，另一端是 USB接口。', ['RJ45', '与第二题查重率100%'], 6],
        ['在网络中，网卡的工作是双重的：一方面它负责( ) ，解包后，数据通过主板上的总线传输给本地计算机；另一方面它将本地计算机上的数据包送入网络 。', '接收网络上传过来的数据帧', 4],
        ['如果某台显示器的屏幕刷新率从60Hz调整到了85Hz，那么( )。', '这时候的显示器更适合人们长时间观察其屏幕了。', 2],
        ['下列不是液晶平板显示器优点的是( )。', '亮度高', 5],
        ['为达到较好的显示效果，液晶显示器的屏幕响应时间至少能够达到( )以内。', '30ms', 5],
        ['目前( )已经成为继CPU之后发展变化最快的部件。', ['显示卡', '显卡'], 1],
        ['图形处理单元的英文缩写是( )。', 'GPU', 1],
        ['U盘接口标准是( ).', 'USB', 1],
        ['常见CD光盘标称CD-R光盘/刻录盘 52X700容量含义为( )。', '700MB', 5],
        ['CD-RW驱动器也有速度之分，它由CD-RW的刻写速度、擦写速度和读盘速度三部分组成，其中( )速度是最重要的技术指标。', '刻写', 1],
        ['以下哪个厂家不是硬盘厂商。( )', 'Sony', 1],
        ['新的磁盘在使用以前必须为它划分磁道和扇区，并建立为盘所必要的各种引导和识别信息，这一过程叫做()。', '磁盘格式化', 2],
        ['现有一块无标记的硬盘，通过测试软件得知其主轴转速为15000rpm，由此可以判断这是一块( )接口硬盘。', 'SAS', 3],
        ['硬盘盘片上记录信息的圆形轨迹称为( )。', '磁道', 1],
        ['现在硬盘主轴中普遍使用的液态轴承马达技术，是为了解决( )问题。', '磨损', 2],
        ['下面哪种材料不能做硬盘盘片。', '金属', 5],
        ['硬盘的寻道是靠移动( )寻道。', '磁头', 1],
        ['台式机DDR2内存槽的供电电压一般为( )V。', '1.8', 5],
        ['台式机DDR2内存槽一般有( )只引脚。', '240', 5],
        ['台式机DDR3内存槽的供电电压一般为( )V。', '1.35V~1.5V', 5],
        ['台式机DDR3内存槽一般有( )只引脚。', '240', 5],
        ['台式机DDR4内存槽的供电电压一般为( )V。', '1.2', 5],
        ['台式机DDR4内存槽一般有( )只引脚。', '288', 5],
        ['DDR内存的工作电压是( )V。', '2.5', 5],
        ['DDR内存脚缺口为( )个。', '1', 3],
        ['AGP总线连接的设备有( )。', '显示卡', 5],
        ['主板所用的PCB是由几层树脂材料粘合在一起的，内部采用( )箔走线。', '铜', 3],
        ['USB总线在一个端口上最多可以连接( )个设备。', '127', 5],
        ['AGP的最大特点是( )。', '直接内存执行', 5],
        ['AGP以( )规范为基础。', '66MHz Reversion 2.1', 5],
        ['AT总线标准是由( )公司最早提出的。', 'IBM', 4],
        ['8/16位的“工业标准结构”总线又称为( )总线。', 'ISA', 5],
        ['I/O总线用于CPU与除( )之外的其它部件的连接。', 'RAM', 3],
        ['微型计算机主板上的系统总线一般都是根据特定类型的( )设计的。', 'CPU', 4],
        ['主板面积为30.5cm*24.4cm的主板是( )主板。', 'ATX', 4],
        ['总线结构的优点是采用了( )的结构设计方法。', '模块化', 5],
        ['USB2.0接口的数据传输率最高可达( )Mbps。', '480', 3],
        ['USB3.0接口的数据传输率最高可达( )Gbps。', '5', 2],
        ['1394总线的数据传输率最高可达( )Mbps。', '400', 5],
        ['USB每个外设间距离(线缆长度)可达5米，可以使用( )连接。', '串行', 5],
        ['IEEE1395采用树形结构时可达多少层，从主机到最末端外设总长可达多少米。( )', '16、72', 5],
        ['主流主板上，BIOS芯片一般是集成在( )上。', '主板', 1],
        ['PCI总线和ISA/EISA总线之间是通过( )连接的。', '南桥芯片', 5],
        ['CPU总线和PCI总线是通过( )连接的。', '南桥芯片', 5],
        ['如果在主板的一个IDE插口上同时接上硬盘和光驱，硬盘应该设置为( )，光驱设置为()，这样性能最佳。', 'Master Slave', 5],
        ['PCI具有的功能是( )。', 'Pnp', 5],
        ['Flex ATX主板标准是( )所开发的。', 'Intel', 4],
        ['选购主板时要考虑的主要因素是( )。', '稳定性和功能', 1],
        ['微型计算机系统由( )两大部分组成。', '硬件系统软件系统', 2],
        ['目前，世界上最大的 CPU 及相关芯片制造商是( )', ['Intel', '我可能会选AMD'], 3],
        ['计算机CPU的内存寻址范围可以为4GB，这一设计是从( )CPU开始的。', 'Intel 80386DX', 5],
        ['第一个8位微处理器的代号是( )。', '8008', 5]
    ], [
        ['addClass', 'mainCtr_' + fileDate]
    ])
}