function execute() {
    let fileDate = '22-04-06';
    if (sessionStorage.getItem('execute_all') == 'true' || sessionStorage.getItem('execute_all') == 'direct') {
        loading(fileDate, call(fileDate));
    } else {
        if (location.search.length == 0) {
            loading(fileDate, call(fileDate));
        } else {
            console.log(location.search);
        }
    }
}

if (sessionStorage.getItem('fileDate' + "220406") == "220406") {} else {
    execute();
    sessionStorage.setItem('fileDate' + "220406", "220406");
    window.addEventListener('load', function () {
        sessionStorage.removeItem('fileDate' + "220406");
    });
}

function call(fileDate) {
    tit('多选 * 30', fileDate, 1);

    Q_KV_module([
        ['目前常见的网络传输介质有( )。', ['双绞线', '光纤', b('同轴电缆')], 4, 'list'],
        ['BIOS密码清除的几种方法( )', ['取下CMOS电池BIOS就会放电解除密码', '用主板上的放电跳线来消除BIOS密码', '刷新BIOS文件的方法来破解密码'], 7, 'list'],
        ['通电测试需要注意哪些事项？( )', ['按照“先开外设，后开主机”的原则进行', '关机的时候按照“先关主机，再关外设”的原则进行', '启动之后，认真观察主机和显示器的反应，如果出现冒烟、发出糊味等异常情况应立即关机断电，防止硬件的进一步损坏', '如果开机之后无反应，就要根据实际情况仔细检查各部位是否连接牢靠，接触是否良好，再进行针对性的操作'], 7, 'list'],
        ['安装硬盘主要有哪几项工作？( )', ['硬盘主从跳线', '固定硬盘到主机箱', '连接数据线', '连接电源线'], 3, 'list'],
        ['组装计算机的时候需要注意哪些问题？( )', ['防静电', '电脑配件要轻拿轻放，尽量拿板卡边缘，不要用手触摸金手指和芯片', '固定螺丝的时候，不要拧的太紧，防止螺丝滑死或板卡变形，用力要适度，能固定无松动即可', '禁止带电拔插'], 5, 'list'],
        ['简述装机步骤。( )', ['连接主板与机箱面板的连线、连接显示器、键盘、鼠标', '安装CPU和CPU风扇、安装硬盘、光驱、软驱并连接电源线和数据线', '安装内存条', '将主板固定在机箱里、安装机箱电源并连接与主板的电源线'], 3, 'list'],
        ['内存条的安装需要注意哪些事项？是如何安装的？( )', ['将内存条从包装盒里拿出，不要用手触摸金手指更不要用手触摸内存芯片以免损坏', '在主板上找到内存插槽用手轻轻将两边的卡子向外掰开', '将内存条垂直放入内存插槽，注意内存条上的卡口要和主板上的卡口要保持一致', '双手在内存条两端均匀用力，使得两边的白色卡子能将内存牢牢卡住'], 2, 'list'],
        ['主板安装的时候需要连接哪些主要的连线与作用的？( )', ['PWR ON电源开关', 'RESET SW重启', 'HDD.LED硬盘指示灯', 'POWER LED电源指示灯'], 2, 'list'],
        ['常见的网卡的传输速率主要有( ) .', ['10M', '100M', '10/100M', '10/100/1000M'], 2, 'list'],
        ['音箱是将() 还原成 () 的一种设备，主要有( )等部分组成。', ['高频信号', '声音信号', '箱体', '扬声器', '功放'], 3, 'list'],
        ['显示卡专用的存储芯片有( )。', ['VRAM', 'WRAM', 'SGRAM'], 7, 'list'],
        ['DVD光盘的容量是( )。', ['4.7G', '17G', '25G', '50G'], 5, 'list'],
        ['计算机常用的存储器有( )。', ['IDE盘 <em style = "color: ' + 'red' + '">(吐槽：我没看错吧？还IDE？都淘汰多少年了？你们教学的跟不上时代就算了，别误导小白好吧)</ em>', 'SSD盘', 'NVME盘', 'SATA盘'], 1, 'list'],
        ['目前使用的内存主要是 ( ) 。', ['DDR4', 'DDR', 'DDR2', 'DDR3'], 1, 'list'],
        ['笔记本电脑的主板要求( )。', ['集成能力强', '功耗低', '散热少', '体积小'], 2, 'list'],
        ['CPU的封装形式上可以分为( ).', ['Slot架构', '', 'Socket_7架构 <em style="color:' + 'red' + '">(其他干扰选项全不给，就给个正确答案，还要求一字不差背下来，如果下次考试连答案答案前的序列都要写上去才算对。呵呵，那我真的笑了)</em>'], 8, 'list'],
        ['当前的CPU市场上，知名的生产厂家是( )。', ['Intel公司', '', 'AMD公司'], 1, 'list'],
        ['AT电源包含( )V输出。', ['+5', '-5', '+12', '-12'], 2, 'list'],
        ['ATX的内部结构包括( )。', ['滤波和整流组件', '直流稳压组件', '开关电路'], 3, 'list'],
        ['机箱的技术指标包括：( )。', ['坚固性', '可扩充性', '散热性', '屏蔽性'], 2, 'list'],
        ['无线安全加密类型有( )。', ['WPA-PSK/WPA2-PSK', 'WPA/WPA2', 'WEP'], 7, 'list'],
        ['一个完整的企业局域网通常都由( )组成。', ['企业骨干网', '服务器子网', '办公室子网', '管理子网', 'Internet连接子网'], 5, 'list'],
        ['Windows Server 2008r2支持的vpn协议有( )。', ['L2tp', 'pptp', 'sstp'], 3, 'list'],
        ['宽带路由器PPoE<u style="color:' + '#c6d7ff' + '; margin:' + '0 0.8rem' + '">拔号上网</u>的需进行( )几个步骤。<i style="color:' + '#333' + '">(你这题目不是病句吗？)</i>', ['正确连接路由器', '进入宽带路由器管理模式', '配置上网设备的IP为自动获取', '设置宽带路由器上网方式为PPPoE', '设置宽带拨号上网的帐号和密码'], 6, 'list'],
        ['VPN使用的两种隧道协议是( )。', ['PPTP', 'L2TP'], 5, 'list'],
        ['目前应用的比较多的web服务软件主要包括( )等。', ['IIS', '', '', 'Apache'], 8, 'list'],
        ['以下哪些是Internet的特点( )', [i('便于检索各类信息'), '<strong>不论采用何种协议，任何两台主机之间都可以进行通信</strong>', b('信息容量大'), '<b>信息可以在全球范围内传播</b>', '使用者众多'], 3, 'list'],
        ['关于IPV4与IPV6地址说法正确的是( )', ['IPV6可有效的解决全球IPV4地址枯竭的问题', b('IPV4地址长度为32位'), b('IPV6地址长度为128位')], 3, 'list'],
        ['打印机的数据传输接口有( )', ['usb', '网线接口', '并行接口'], 3, 'list'],
        ['局域网常用设备有：( )', ['线缆，如光纤、双绞线、同轴电缆等', '交换机', '路由器'], 3, 'list']
    ], [
        ['addClass', 'mainCtr_' + fileDate]
    ])
}