function execute() {
    let fileDate = '22-03-30';
    if (sessionStorage.getItem('execute_all') == 'true' || sessionStorage.getItem('execute_all') == 'direct') {
        loading(fileDate, call(fileDate));
    } else {
        if (location.search.length == 0) {
            loading(fileDate, call(fileDate));
        } else {
            console.log(location.search);
        }
    }
}

if (sessionStorage.getItem('fileDate' + "220330") == "220330") {} else {
    execute();
    sessionStorage.setItem('fileDate' + "220330", "220330");
    window.addEventListener('load', function () {
        sessionStorage.removeItem('fileDate' + "220330");
    });
}

function call(fileDate) {
    tit('单选 * 61', fileDate, 1);

    Q_KV_module([
        ['下列图像不属于网上专用格式的是( )。', 'PSD', 1],
        ['图像处理软件Photoshop的专用图像格式是( )。', 'PSD', 1],
        ['以下哪一项不属于 H.264 视频编码标准框架( )。', 'MEI Profile', 7],
        ['Apple 手持终端(iphone，ipod，ipad)本地播放器支持以下哪种视频编码( )。', ['H.264+AAC', 'AVC+AAC'], 3],
        ['Adobe Flash Player 不支持以下哪种音视频格式( )。', 'MOV: AVC+AAC', 2],
        ['以下哪一项不是视频文件封装格式( )。', ['AVC', 'AVC/HEVC 等是视频编码技术'], 1],
        ['( )以数字化方式存储、处理信息，经过编码压缩后的信息数据量小。', '交互类媒体', 4],
        ['多媒体技术则是指利用计算机综合处理( )信息。', '多种媒体', 5],
        ['多媒体信息是指集文字、图形与图像、声音、动画、视频为—体的( )。', '综合媒体信息', 3],
        ['共享上网有几种实现方法，其中( )是侦听请求并执行应答服务的软件。', '代理服务器', 3],
        ['共享上网有几种实现方法，其中( )是Windows系统针对家庭网络或小型办公网络提供的一种Internet连接共享服务。', 'ICS', 5],
        ['远程控制软件不可以满足( )功能。', '远程重装系统', 1],
        ['远程控制软件可以支持( )功能。', '远程文件传输', 1],
        ['下列哪一个是远程控制软件( )。', '向日葵', 2],
        ['在不知道对方机器是否装有解压缩软件时可以在压缩文件时，选择( )。', ['创建自释放档案文件', '创建自释放程序'], 1],
        ['WinRAR 创建的自解压文件的扩展名是( )。', 'rar', 1],
        ['WinRar是常用的( )工具软件。', '压缩与解压缩', 1],
        ['下列属于压缩软件工具的是( )。', 'WinRaR', 1],
        ['关于WINRAR和WINZIP软件的说法中，正确的是( )。', 'WINRAR可给压缩 文件加密码和注释', 1],
        ['软件( )不属于解压缩软件。', 'Netmeeting', 1],
        ['WinRAR是一个很强大的压缩软件工具，它提供了对RAR和ZIP文件的完整支持，不能 解压( )格式文件。', 'ArP', 5],
        ['通过压缩软件对文件进性压缩，文件占用磁盘空间会( )。', ['变小', '减小'], 1],
        ['为了防止重要的文件被轻易窃取，Win RAR通过( )操作来保护文件。', '设置密码', 1],
        ['使用迅(吸血)雷的( )功能，可以一次下载很多相似的文件。', '批量下载', 1],
        ['使用下载工具时，下载工具不能具备的功能是( )。', '加快网速', 1],
        ['使用下载软件时设置“最多同时进行的任务数5”，这意味着( )。', '同时进行的任务数最多有5个', 1],
        ['下列哪一个不是网际快车为已下载的文件设置的缺省创建类别( )。', ['电影', '用过网际快车的都快10年网龄了吧'], 2],
        ['CuteFTP具有迅雷不具备的功能是( )。', ['上传文件', '艹，我上传文件到服务器用的就是这个！'], 1],
        ['类似thunder://QUFodHR41OTo4k4LnJhclpa 的链接必须使用( )下载。', ['迅雷', '吸血雷'], 1],
        ['在 windows中对文件进行备份时，有下列哪些类型会将备份文件标示为备份( )。', '副本', 1],
        ['系统的备份核心的思想( )。', '保障文件防患于未然，有备无患', 8],
        ['使用GHOST软件，表示将磁盘备份成映像文件的操作是( )。', 'local->disk->to image', 7],
        ['某个数据的事务日志备份按钮为灰色，则很有可能是该数据故障还原模型被设为( )。', '简单', 4],
        ['软件的备份作业属性中不可以选择的备份方式。( )', '一键式备份', 5],
        ['Windows XP自带的备份工具与Symantec Norton Ghost两个备份工具进行分区备份 时，下列叙述错误的是( )', '前者还原时选择“备份工具— ‘备份’ 标签页—开始还原”', 7],
        ['为了恢复数据，进行文件或文件组备份时，还必须进行( )。', '事务日志备份', 3],
        ['一般在数据较小、数据很少被修改或事务日志已满的情况下，推荐采取( )方式进行数据备份。', '数据完全备份', 2],
        ['通过对( )进行备份，可以用备份镜像对系统进行还原。', '硬盘', 1],
        ['假如某设备的( )未能正确安装，便不能正常工作。', '驱动程序', 1],
        ['在安装或重装Windows时需要安装驱动程序，在购买了某些新硬件之后也需要安装 ( )。', '驱动程序', 1],
        ['能够智能识别计算机硬件，匹配相应( )并提供快速的下载与安装。', ['驱动程序', '你主语呢？'], 6],
        ['新安装的打印机无法正常打印应当安装( )。', '打印机驱动', 1],
        ['电脑开机无法上网应当检查下列( )。', '网卡驱动', 1],
        ['下列( )设备不需要用户安装设备驱动程序。', '共享设备', 2],
        ['所谓即插即用就是指没有( )程序仍然能使用设备的技术。', '驱动', 1],
        ['在Windows XP中，如果某设备的安装驱动程序没被正确安装，设备管理器在显示该设备时就可能以一个( )作为它的图标。', '黄色的惊叹号', 1],
        ['一个用户运行Windows XP时，不小心安装了错误的声卡驱动程序，技术人员如何很 容易地修复这个问题？( )', ['在设备管理器中使用“返回驱动程序”', '《技术人员》'], 1],
        ['下列选项中，( )被称为计算机硬件和操作系统之间的桥梁，用来管理相应的计算机硬 件。', '驱动程序', 1],
        ['下列选项中，( )不属于计算机硬件设备。', '驱动程序', 1],
        ['安装系统时可以先进入( )进行设置。', 'PE', 1],
        ['系统的主要功能有( )。', '处理机管理、存储器管理、设备管理、文件系统', 5],
        ['在一块新硬盘上通过光盘安装Windows操作系统，则正确的操作系统是( )。', '设置光盘为第一个启动设备-硬盘分区-格式化分区-安装系统', 2],
        ['电脑启动后打开浏览器一直跳转广告无法正常使用应该对电脑( )。', '杀毒扫描', 1],
        ['电脑开机广告多应当如何处理( )。', '关闭不必要的启动项', 1],
        ['对电脑的缓存进行优化的效果是( )。', '加快电脑反应速度', 1],
        ['系统优化对硬盘的作用优点是( )。', '数据读写更快', 1],
        ['软件优化可以检查( )。', '磁盘错误', 1],
        ['优化软件是对电脑内存空间进行( )。', '释放', 1],
        ['优化软件对注册表可进行定期( )。', '清理', 1],
        ['优化大师不可以使用设置向导优化的是( )。', '系统安全', 5],
        ['利用优化大师不能清理的是( )。', '系统日志', 2]
    ], [
        ['addClass', 'mainCtr_' + fileDate]
    ])
}